app/views/posts/show.html.erb

SELECT "reviews".* FROM "reviews"  WHERE "reviews"."post_id" = ?  [["post_id", 5]]
---
<b>REVIEWS:</b>
<% @post.reviews.each do |posti| %>