app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  WHERE (content LIKE '%texto%')  ORDER BY created_at DESC
SELECT "posts".* FROM "posts"   ORDER BY created_at DESC
---
  def index
    @q = params[:q]
    if @q
      pal=@q.to_s
      @posts = Post.where("body LIKE '%#{pal}%'").order("created_at DESC")
    else
      @posts = Post.order("created_at DESC")

SELECT "posts".* FROM "posts"   ORDER BY created_at DESC
---
  def principal
    @posts = Post.order("created_at DESC")

SELECT "posts".* FROM "posts"
---
  def reporte
    @posts = Post.all

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "posts" SET "like" = ?, "updated_at" = ? WHERE "posts"."id" = 5  [["like", 1], ["updated_at", "2015-04-07 21:25:11.046141"]]
---
  def like
    @post = Post.find(params[:id])
    @post.like = @post.like + 1
    if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "like" = ?, "updated_at" = ? WHERE "posts"."id" = 7  [["like", 2], ["updated_at", "2015-04-08 15:21:44.533205"]]
---
  def dislike
    @post = Post.find(params[:id])
    @post.like = @post.like - 1
    if @post.save

INSERT INTO "posts" ("body", "created_at", "like", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "texto tesss"], ["created_at", "2015-04-08 14:04:50.291392"], ["like", 0], ["title", "uno"], ["updated_at", "2015-04-08 14:04:50.291392"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save